Alizz-ONEIC API/wsdls/billInquiry.wsdl

<wsdl:definitions
  xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
  xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex"
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
  xmlns:wsa10="http://www.w3.org/2005/08/addressing"
  xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy"
  xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy"
  xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract"
  xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
  xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
  xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:tns="http://tempuri.org/"
  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
  xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl"
  xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/"
  name="BillInquiry"
  targetNamespace="http://tempuri.org/">
  <wsp:Policy wsu:Id="WSHttpBinding_IBillInquiry_policy">
    <wsp:ExactlyOne>
      <wsp:All>
        <wsrm:RMAssertion xmlns:wsrm="http://schemas.xmlsoap.org/ws/2005/02/rm/policy">
          <wsrm:InactivityTimeout Milliseconds="600000"/>
          <wsrm:AcknowledgementInterval Milliseconds="200"/>
        </wsrm:RMAssertion>
        <wsaw:UsingAddressing/>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsp:Policy wsu:Id="WSHttpBinding_IBillInquiry1_policy">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <wsp:Policy>
            <sp:TransportToken>
              <wsp:Policy>
                <sp:HttpsToken RequireClientCertificate="false"/>
              </wsp:Policy>
            </sp:TransportToken>
            <sp:AlgorithmSuite>
              <wsp:Policy>
                <sp:Basic256/>
              </wsp:Policy>
            </sp:AlgorithmSuite>
            <sp:Layout>
              <wsp:Policy>
                <sp:Strict/>
              </wsp:Policy>
            </sp:Layout>
          </wsp:Policy>
        </sp:TransportBinding>
        <wsaw:UsingAddressing/>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsp:Policy wsu:Id="BasicHttpBinding_IBillInquiry1_policy">
    <wsp:ExactlyOne>
      <wsp:All>
        <sp:TransportBinding xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
          <wsp:Policy>
            <sp:TransportToken>
              <wsp:Policy>
                <sp:HttpsToken RequireClientCertificate="false"/>
              </wsp:Policy>
            </sp:TransportToken>
            <sp:AlgorithmSuite>
              <wsp:Policy>
                <sp:Basic256/>
              </wsp:Policy>
            </sp:AlgorithmSuite>
            <sp:Layout>
              <wsp:Policy>
                <sp:Strict/>
              </wsp:Policy>
            </sp:Layout>
          </wsp:Policy>
        </sp:TransportBinding>
      </wsp:All>
    </wsp:ExactlyOne>
  </wsp:Policy>
  <wsdl:types>
    <xsd:schema targetNamespace="http://tempuri.org/Imports">
      <xsd:import schemaLocation="http://ef-webserve-001:6004/BillInquiry.svc?xsd=xsd0" namespace="http://tempuri.org/"/>
      <xsd:import schemaLocation="http://ef-webserve-001:6004/BillInquiry.svc?xsd=xsd1" namespace="http://schemas.microsoft.com/2003/10/Serialization/"/>
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="IBillInquiry_Inquire_InputMessage">
    <wsdl:part name="parameters" element="tns:Inquire"/>
  </wsdl:message>
  <wsdl:message name="IBillInquiry_Inquire_OutputMessage">
    <wsdl:part name="parameters" element="tns:InquireResponse"/>
  </wsdl:message>
  <wsdl:portType name="IBillInquiry">
    <wsdl:operation name="Inquire">
      <wsdl:input wsaw:Action="http://tempuri.org/IBillInquiry/Inquire" message="tns:IBillInquiry_Inquire_InputMessage"/>
      <wsdl:output wsaw:Action="http://tempuri.org/IBillInquiry/InquireResponse" message="tns:IBillInquiry_Inquire_OutputMessage"/>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="WSHttpBinding_IBillInquiry" type="tns:IBillInquiry">
    <wsp:PolicyReference URI="#WSHttpBinding_IBillInquiry_policy"/>
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="Inquire">
      <soap12:operation soapAction="http://tempuri.org/IBillInquiry/Inquire" style="document"/>
      <wsdl:input>
        <soap12:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap12:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:binding name="WSHttpBinding_IBillInquiry1" type="tns:IBillInquiry">
    <wsp:PolicyReference URI="#WSHttpBinding_IBillInquiry1_policy"/>
    <soap12:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="Inquire">
      <soap12:operation soapAction="http://tempuri.org/IBillInquiry/Inquire" style="document"/>
      <wsdl:input>
        <soap12:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap12:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:binding name="BasicHttpBinding_IBillInquiry" type="tns:IBillInquiry">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="Inquire">
      <soap:operation soapAction="http://tempuri.org/IBillInquiry/Inquire" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:binding name="BasicHttpBinding_IBillInquiry1" type="tns:IBillInquiry">
    <wsp:PolicyReference URI="#BasicHttpBinding_IBillInquiry1_policy"/>
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="Inquire">
      <soap:operation soapAction="http://tempuri.org/IBillInquiry/Inquire" style="document"/>
      <wsdl:input>
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="BillInquiry">
    <wsdl:port name="WSHttpBinding_IBillInquiry" binding="tns:WSHttpBinding_IBillInquiry">
      <soap12:address location="http://ef-webserve-001:6004/BillInquiry.svc"/>
      <wsa10:EndpointReference>
        <wsa10:Address>http://ef-webserve-001:6004/BillInquiry.svc</wsa10:Address>
      </wsa10:EndpointReference>
    </wsdl:port>
    <wsdl:port name="WSHttpBinding_IBillInquiry1" binding="tns:WSHttpBinding_IBillInquiry1">
      <soap12:address location="https://ef-webserve-001:7004/BillInquiry.svc/WSHttps"/>
      <wsa10:EndpointReference>
        <wsa10:Address>
          https://ef-webserve-001:7004/BillInquiry.svc/WSHttps
        </wsa10:Address>
      </wsa10:EndpointReference>
    </wsdl:port>
    <wsdl:port name="BasicHttpBinding_IBillInquiry" binding="tns:BasicHttpBinding_IBillInquiry">
      <soap:address location="http://ef-webserve-001:6004/BillInquiry.svc/BasicHttp"/>
    </wsdl:port>
    <wsdl:port name="BasicHttpBinding_IBillInquiry1" binding="tns:BasicHttpBinding_IBillInquiry1">
      <soap:address location="https://ef-webserve-001:7004/BillInquiry.svc/BasicHttps"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
